/*

	자바 스크립트 메모리 저장하는 방법
	1. 변수	: 메모리 1개 저장할 수 있는 공간 [수정가능] let
	2. 상수	: 메모리 1개 저장할 수 있는 공간 [수정불가능] const
	3. 배열	: 메모리 여러개 저장할 수 있는 공간[저장 순서 = 인덱스] 	* 반복문에 활용하기 좋음		* 배열 = 객체
	4. 객체	: 여러개 메모리들을 하나의 메모리에서 관리
		D[document]O[object]M[model] 객체 => 미리 만들어진 객체들
			1. 이벤트
				1. DOMContentLoaded 이벤트 : html 모두 호출된 후 실행되는 이벤트 (전체 감싸기)
					// * 미사용시 [js 파일은 body 가장 하단에 배치해서 호출해줘야 됨]
				2. click	: 해당 문서객체를 클릭했을 때 발생하는 이벤트
				3. change	: 해당 문서객체가 변경되었을때 발생하는 이벤트 [모든 입력후에 커서 변경이 있을때 이벤트 발생]
				4. keyup	: 해당 문서객체에서 키보드를 눌렀을때 발생하는 이벤트 [입력하면서 계속적인 이벤트 발생]
				5. contextmenu(오른쪽 마우스 클릭 이벤트 잘안씀ㅎㅎㅎ)
								
			2. 메소드
			 	1. let 객체명 = document.qyerySelector('식별자')		// 1개만 선택
			 	2. let 객체명[배열] = document.qyerySelectorAll('식별자')	// 다중 선택
			 	
			 		0. 값 조작하기 [속성이 존재하는 태그만 가능]
			 			1. [호출] 객체명.value				[저장] 객체명.value					// input, textarea, select
			 			2. [호출] 객체명.checked											// checkbox
			 			3. [호출] 객체명.options			객체명.options.selectedIndex		// select
			 											// 옵션들 중 내가 선택한 인덱스
					1. 글자 조작하기 
						1. [호출] 객체명.textContent ,		[저장] 객체명.textContent = `${ 텍스트내용 }` 	// div, p, span	
						2. [호출] 객체명.innerHTML			[저장] 객체명.innerHTML = 값
						
					2. 속성 조작하기 
						1. 객체명.setAttribute( 속성이름, 값 ) --> 객체명.속성명 = 값
						2. 객체명.setAttribute( 속성이름 )
					
					3. 스타일 조작하기
						1. 객체명.style.css속성명 = 값
						
					4. 문서 객체 생성/제거
						1. [생성] document.createElement( '태그명' )
						2. [html 삽입] 상위문서객체.appendChild( 하위문서객체 )
						3. [삭제] 상위문서객체.removeChild( 하위문서객체 )
						4. [상위문서 객체 찾기] 문서객체.parentNode
					
					* 문서 객체에 이벤트 추가 메소드
						객체명.addEventListener( '이벤트', 함수명)
						객체명.addEventListener( '이벤트', ( ) => { })
						객체명.removeEventListener( '이벤트', 함수명 )						

	
 */
 
 // 1. 변수명으로 생성 : 5명 이름과 나이를 저장할 변수 각각 생성
 let 학생1_이름 = "유재석1"
 let 학생1_나이 = 30
 
 let 학생2_이름 = "유재석2"
 let 학생2_나이 = 40
 
 let 학생3_이름 = "유재석3"
 let 학생3_나이 = 20
 
 let 학생4_이름 = "유재석4"
 let 학생4_나이 = 15


 
 // 2. 배열로 생성 : 5명 이름과 나이를 저장할 변수를 배열로 생성
  let 학생목록1 = [ ["유재석1, 30"], ["유재석2, 40"], ["유재석3, 20"], ["유재석4, 15"] ]
  
/*  
 // 3. 객체로 생성
  let 학생목록2 = { 
	이름 : '유재석',
	나이 : '50'
}
  let 학생목록2 = [ 학생객체, 학생객체, 학생객체 ]
  
 */ 
  
  
  
  
  
  
  
  
  
  
  