/*


	1. 로또 시작하기 버튼을 눌렀을때 로또 버튼 45개 출력
		- 나 선택
	2. 45개 버튼 중 선택한 번호가 누적되어 출력되도록
	
	3. 중복 숫자는 누를 수 없음
	4. 6개까지만 선택 가능
		- 번호 추첨
	5. 당첨번호 6개가 랜덤으로 출력되도록(6개 한번에, 6개 까지만)
	6. 중복 숫자는 출력될 수 없음
	7. 내가 선택한 번호와 추첨된 번호 비교
	8. 당첨된 번호가 어떤 것인지 출력
	9. 당첨자 발표(1등. 22억! 2등. 3천만원! 3등. 100만원 4등. 5만원 5등. 5천원 꽝!)

*/


let 로또번호저장 = [];		// 빈칸으로 만들었다가 배열로 수정
let count = 0;


// 로또 버튼 45개 만들기
function 로또버튼생성(){
	
	let 로또판생성 = '';	// 0으로 만들었다가 0이 찍혀서 빈칸으로 수정
	for( let i = 1; i < 46; i++ ){	// 
		로또판생성 += `<button id=${i} onclick=선택(${i})> ${i} </button>`					
								// 온클릭에 function 이름을 넣어서 바로 실행되도록
	} // for 종료
	document.getElementById('로또판생성').innerHTML = 로또판생성 // 저장된 버튼들을 html에 있는 로또판생성에 보내줌
}// f 종료



// 로또 숫자를 눌렀을때 실행
function 선택( i ){
	if( count == 6 ){	// 카운트가 6이되면 멈추기
		alert("번호 선택이 완료되었습니다.")					// 6개가 눌리는 순간 딱! 멈추고 싶은데 7번째를 눌러야 실행됨 ㅠㅠㅠ
		컴퓨터선택()
		return;
		// 조건이 맞지 않을때 나가서 for문 실행
	}

	for ( let j = 0; j < 6; j++ ){
		if ( 로또번호저장[j] == null ){	// 로또번호저장 배열[j]번째가 값이 없을 경우
			로또번호저장[j] = `${ i }`
			document.getElementById('내번호출력').innerHTML = 로또번호저장
			console.log(로또번호저장)
			
			중복검사()
			console.log(중복검사())
			
			count++;
			return;
		}// if 종료	
	}//for 종료
	
}// f 종료


// 랜덤함수 => 컴퓨터 턴

function 컴퓨터선택( ){ // 내가 선택하면 컴퓨터가 난수 하나씩 선택해줌 근데 배열에 담겨지지 않음
	let 난수 = [];
	for( let i = 0; i < 6; i++ ){
		난수[i] = Math.floor(Math.random()*45+1);		// Math 함수를 사용해서 랜덤 숫자를 출력 
	// 기준 값 : 0보다 같거나 크고 1미만 --> 기준 값 때문에 0부터 시작하는데 난 숫자를 1부터 받아야되서 +1 해줌
	}
	document.getElementById('당첨번호출력').innerHTML = 난수
	console.log( 난수 )
	return;						// 7번째 번호를 다시 누르면 또 실행됨 어디서 제한을 줘야하는지 모르겠음 ㅠㅠ
}




// 중복검사 함수써서 같은 값이 있는지

function 중복검사( i ){
	for ( let j = 0; j < 6; j++){
		
		if( 로또번호저장[i] == i ){	// 선택한 숫자가 동일할 경우
		로또번호저장[i] = null	// 이미 값을 저장했으니 비워줘야함
		alert("이미 선택한 번호입니다. 다시 선택해주세요.")
		
		return;
		}
	}
}


/*
function 중복검사( i ){
	
	let index = 로또번호저장.indexOf(로또번호저장[i])		// 로또번호저장 배열에있는 인덱스 번호 중
	if( index == i ){
		
		alert("이미 선택된 번호 입니다. [ 취소합니다 ]")
		// 로또번호저장.splice( index, 1 )
		
	}
}
*/







// 함수 쓴거는 선택할때마다 확인해야되니까 for 넣어줘야댐 























