/*


	1. 로또 시작하기 버튼을 눌렀을때 로또 버튼 45개 출력
	
		- 나 선택
		
		
	2. 45개 버튼 중 선택한 번호가 누적되어 출력되도록
	
	3. 중복 숫자는 누를 수 없음
	4. 6개까지만 선택 가능
		- 번호 추첨
	5. 당첨번호 6개가 랜덤으로 출력되도록(6개 한번에, 6개 까지만)
	6. 중복 숫자는 출력될 수 없음
	7. 내가 선택한 번호와 추첨된 번호 비교
	8. 당첨된 번호가 어떤 것인지 출력
	9. 당첨자 발표(1등. 22억! 2등. 3천만원! 3등. 100만원 4등. 5만원 5등. 5천원 꽝!)

*/


let 로또번호저장 = [];		// 빈칸으로 만들었다가 배열로 수정
let count = 0;

// 로또 버튼 45개 만들기
function 로또버튼생성(){
	
	let 로또판생성 = '';
	for( let i = 1; i < 46; i++ ){	
		로또판생성 +=	`<button id=${i} onclick="선택(${i})"> ${i} </button>`					
								// 온클릭에 function 이름을 넣어서 바로 실행되도록
	} // for 종료
	document.getElementById('로또판생성').innerHTML = 로또판생성	
}// f 종료



// 로또 숫자를 눌렀을때 실행
function 선택( i ){
	if( count >= 6 ){
		alert("번호 선택이 완료되었습니다.")
		return;	// 조건이 맞지 않을때 나가서 for문 실행
	}
	
	for ( let j = 0; j < 6; j++ ){
		if ( 로또번호저장[j] == null ){	// 로또번호저장 배열[j]번째가 값이 없을 경우
			로또번호저장[j] = `${ i }`;
			console.log(로또번호저장)
			count++;
			return;
			
		}// if 종료
	}//for 종료
	
}// f 종료


// 랜덤함수 => 컴퓨터턴

// 중복검사 함수써서 같은 값이 있는지
// 함수 쓴거는 선택할때마다 확인해야되니까 for 넣어줘야댐 





















