package java1.c조건문반복문;

import java.util.Scanner;

public class EX4_자판기 {
	public static void main(String[] args) {
		
		
		
		// 0. 입력 객체
		Scanner scan = new Scanner(System.in);
		
		// 1. 공통 변수( 제품 3개 -> 변수 3개, 장바구니 제품 3개 -> 변수 3개 )
		
		int 콜라재고 = 10;
		int 환타재고 = 10;
		int 사이다재고 = 10;
		// 각 변수에 10 대입
		
		int 콜라구매수 = 0;
		int 환타구매수 = 0;
		int 사이다구매수 = 0;
		
		int 콜라매출수량 = 0;
		int 환타매출수량 = 0;
		int 사이다매출수량 = 0;
		int 총매출금액 = 0;
		
		
		while(true) {	// 2. 무한루프
			
				
				System.out.println( "---------------------------[ 자판기 ]---------------------------\n" );
				System.out.println( "메뉴 : 1. 콜라(300원) 2. 환타(400원) 3. 사이다(500원) 4. 결제 5. 관리자메뉴" );
				System.out.println( "선택 : " );
				int 메뉴선택 = scan.nextInt();
				
				
					// 재고가 있다/없다 [경우의 수 2개]	
				
					// 1번 콜라 선택
					if( 메뉴선택 == 1 ) {						// 1을 입력했을때
					
						if( 콜라재고 > 0 ) {	// 콜라의 재고가 0보다 큰 경우(재고가 있을 경우)
							
							콜라재고--;
							콜라구매수++;
							System.out.println("콜라를 장바구니에 담았습니다.");
							
						}else {	// 재고가 없을 경우
							System.err.println("콜라의 재고가 없습니다.");
						}		
					}
					
					// 2번 환타 선택
					else if( 메뉴선택 == 2 ) {				// 2를 입력했을때
							
						if( 환타재고 > 0 ) {	// 콜라의 재고가 0보다 큰 경우(재고가 있을 경우)
							
							환타재고--;
							환타구매수++;
							System.out.println("환타를 장바구니에 담았습니다.");
							
						}else {	// 재고가 없을 경우
							System.err.println("환타의 재고가 없습니다.");
						}	
					}
					
					// 3번 사이다 선택
					else if( 메뉴선택 == 3) {					// 3을 입력했을때
						
						if( 사이다재고 > 0 ) {	// 콜라의 재고가 0보다 큰 경우(재고가 있을 경우)	
							
							사이다재고--;
							사이다구매수++;
							System.out.println("사이다를 장바구니에 담았습니다.");
							
						}else {	// 재고가 없을 경우
							System.err.println("사이다의 재고가 없습니다.");
						}
					}
					
					
					else if( 메뉴선택 == 4) {					// 4를 입력했을때
						System.out.println("=======================[ 장바구니 ]=======================\n");
						System.out.println("제품명\t구매수\t가격");
						if(콜라구매수 > 0) {
							System.out.println("콜라\t"+콜라구매수+"\t"+(콜라구매수*300));
						}
						if(환타구매수 > 0) {
							System.out.println("환타\t"+환타구매수+"\t"+(환타구매수*400));
						}
						if(사이다구매수 > 0) {
							System.out.println("사이다\t"+사이다구매수+"\t"+(사이다구매수*500)+"\n");
						}
						
						int 총결제금액 = (콜라구매수 * 300) + (환타구매수 * 400) + (사이다구매수 * 500);
						
						
						// **** 제품의 구매 수량 차감 메뉴 **** 
						
						
						
						
						
						System.out.println("안내) 총 결제 예정 금액은 : " + 총결제금액 + " 원");
						System.out.println("안내) 결제하시겠습니까? [Y], [N]");
						String 결제여부 = scan.next();
						
						
						
						
						
						Boolean 결제성공 = false;	// 결제 성공 여부를 저장하는 변수
						
						if( 결제여부.equals("Y") || 결제여부.equals("y") ) {
							System.out.println("안내) 결제 금액을 투입해주세요 : ");
							
							int 투입금액 = scan.nextInt();
							
							if( 총결제금액 > 투입금액 ) {
								System.out.println("안내) 금액이 부족합니다. [ 결제 취소 ] ");
								
								총결제금액 = 0;							
								
							}
							else {
								결제성공=true;
								System.out.println("안내) 구매 완료되었습니다. 주문번호: 0000 [ 잔돈 : " + ( 투입금액 - 총결제금액 ) + " 원 ]");
								System.out.println("콜라 재고량 : " + 콜라재고);
								System.out.println("환타 재고량 : " + 환타재고);
								System.out.println("사이다 재고량 : " + 사이다재고);
								
								콜라매출수량 += 콜라구매수;
								환타매출수량 += 환타구매수;
								사이다매출수량 += 사이다구매수;
								총매출금액 += (콜라구매수 * 300) + (환타구매수 * 400) + (사이다구매수 * 500);
							}
				
							
						}	//if  end
						
						
							if( 결제성공 == false) {	//결제취소 : 금액이 부족하거나 결제여부가 N이면 => 재고를 구매 수 만큼 재고 채우기							
								콜라재고 += 콜라구매수;
								환타재고 += 환타구매수;
								사이다재고 += 사이다구매수;
							}
							콜라구매수 = 0;
							환타구매수 = 0;
							사이다구매수 = 0;
						
					}
					else if ( 메뉴선택 == 5 ){	// 5번 관리자 선택을 눌렀을때
						 
						System.out.println("관리자 메뉴의 비밀번호를 입력해주세요");
						int pw =  scan.nextInt();
						
						if( pw == 1234) {	// 비밀번호 입력 if 시작
							System.out.println("관리자 모드로 접속합니다. 항목을 선택해주세요. 1. 재고추가 2. 매출현황확인");
							int 관리자메뉴선택 = scan.nextInt();
							
							if( 관리자메뉴선택 == 1 ) {		// 관리자 메뉴 선택 1번 시작
								System.out.println("어떤 재고를 추가할지 선택해주요. 1. 콜라 2. 환타 3.사이다");
								int 재고추가 = scan.nextInt();
								
								if( 재고추가 == 1 ) {
									System.out.println("콜라의 추가 수량을 입력해주세요");
									int 콜라추가 = scan.nextInt();
									콜라재고 += 콜라추가;
								}else if( 재고추가 == 2 ) {
									System.out.println("환타의 추가 수량을 입력해주세요");
									int 환타추가 = scan.nextInt();
									환타재고 += 환타추가;
								}else if( 재고추가 == 3 ) {
									System.out.println("사이다의 추가 수량을 입력해주세요");
									int 사이다추가 = scan.nextInt();
									사이다재고 += 사이다추가;
								}							
							}	// 관리자 메뉴 선택 1번 끝
							
							if( 관리자메뉴선택 == 2 ) {		// 관리자 메뉴 선택 2번시작
								System.out.println("현재 매출 현황입니다" );
								System.out.println("콜라 : " + 콜라매출수량 + " 개");
								System.out.println("환타 : " + 환타매출수량 + " 개");
								System.out.println("사이다 : " + 사이다매출수량 + " 개");
								System.out.println("매출 총 금액은 : " + 총매출금액 + " 원 입니다.");
								
							}	// 관리자 메뉴 선택 2번 끝
							
							
						}	// 비밀번호 입력 if 끝
						else {
							System.out.println("비밀번호가 틀렸습니다");
						}
						
					}
					
					
					else {									
						System.err.println("[안내] 선택할 수 없는 번호입니다. 다시 선택해주세요");	// 그외를 입력했을때
					}
			
			
			} // 첫 if 끝	
			

		} // while 끝

		
		
		
		
	}



 
/*
	자판기 프로그램 
		[조건]
		1. 제품명 : 콜라 , 환타 , 사이다 
		2. 초기재고 : 각 10개 
		3. 메뉴판에서 선택한 제품을 장바구니 담기 
			- 선택 제품의 재고가 0 이면 '재고 없음' 출력 -> 나감
			- 제품재고 를 1차감	->  장바구니 제품 의 1증가
			- '장바구니에 담았습니다.'
			
		4. 결제를 선택했을때 장바구니 현황 표시 결제
		5. 결제예정인 금액보다 투입금액 이 부족하면 결제취소 투입금액이 초과 잔돈 출력 
		[화면구현]
		1. 메뉴판 : 1.콜라 2.환타 3.사이다 4.결제 (추가 5.관리자) [ 경우의수 4개 ]
		
		
		[ 추가할 기능 ] 	* 배열이 아니라 제품 추가는 안됨
		1. 제품 구매 수량 차감 메뉴
					
		2. 관리자 메뉴( 비밀번호 :1234 )
			재고 추가 기능
			매출 현황 보기
 */










