package java1.ch5클래스.Cafe_kiosk;

import java.util.Scanner;

public class Cafe_contorller {

	
	// 필드
	
	// 재고 변수
	int 아메리카노_재고 = 10;
	int 바닐라라떼_재고 = 10;
	int 카페라떼_재고 = 10;
	int 카푸치노_재고 = 10;
	int 그린티라떼_재고 = 10;
	           
	// 구매수 변수
	int 아메리카노_구매수 = 0;
	int 바닐라라떼_구매수 = 0;
	int 카페라떼_구매수 = 0;
	int 카푸치노_구매수 = 0;
	int 그린티라떼_구매수 = 0;
	
	// 메뉴별 매출량 변수
	int 아메리카노_매출량 = 0;
	int 바닐라라떼_매출량 = 0;
	int 카페라떼_매출량 = 0;
	int 카푸치노_매출량 = 0;
	int 그린티라떼_매출량 = 0;
	
	int 장바구니 = 0;
	int 총금액 = 0;
	int 총매출금액 = 0;
	
	// 생성자
	
	public Cafe_contorller() {
		
	}
	
	public Cafe_contorller( int 아메리카노_재고, int 바닐라라떼_재고, int 카페라떼_재고, int 카푸치노_재고, int 그린티라떼_재고,
			int 아메리카노_구매수, int 바닐라라떼_구매수, int 카페라떼_구매수, int 카푸치노_구매수, int 그린티라떼_구매수,
			int 장바구니, int 총금액, int 총매출금액 ) {
		
		this.아메리카노_재고 = 아메리카노_재고;
		this.바닐라라떼_재고 = 바닐라라떼_재고;
		this.카페라떼_재고 = 카페라떼_재고;
		this.카푸치노_재고 = 카푸치노_재고;
		this.그린티라떼_재고 = 그린티라떼_재고;
		
		this.아메리카노_구매수 = 아메리카노_구매수;
		this.바닐라라떼_구매수 = 바닐라라떼_구매수;
		this.카페라떼_구매수 = 카페라떼_구매수;
		this.카푸치노_구매수 = 카푸치노_구매수;
		this.그린티라떼_구매수 = 그린티라떼_구매수;
		
		this.장바구니 = 장바구니;
		this.총금액 = 총금액;
		this.총매출금액 = 총매출금액;
		
	}
	
	
	
	// 메소드
	
// ----------------------- 주문시 구매수++ 재고-- 메소드 -----------------------
	
int 아메리카노() {
	if( 아메리카노_재고 > 0 ) { // 아메리카노 재고가 0보다 크면
		아메리카노_구매수++;
		아메리카노_재고--;
		
		
		// System.err.println("매출량 : " +아메리카노_매출량);
	} // if 종료
	else {
		System.err.println(" [안내] 아메리카노 재고가 부족합니다 : 주문취소 ");
	}
	return 아메리카노_구매수;
} // 메소드 종료
	
	

int 바닐라라떼() {
	if( 바닐라라떼_재고 > 0 ) {
		바닐라라떼_구매수++;
		바닐라라떼_재고--;

	} // if 종료
	else {
		System.err.println(" [안내] 바닐라라떼 재고가 부족합니다 : 주문취소 ");
	}
	return 바닐라라떼_구매수;
} // 메소드 종료	
	
	
int 카페라떼() {
	if( 카페라떼_재고 > 0 ) {
		카페라떼_구매수++;
		카페라떼_재고--;

		
	} // if 종료
	else {
		System.err.println(" [안내] 카페라떼 재고가 부족합니다 : 주문취소 ");
	}
	return 카페라떼_구매수;
} // 메소드 종료	
	
	
	
int 카푸치노() {
	if( 카푸치노_재고 > 0 ) {
		카푸치노_구매수++;
		카푸치노_재고--;

		
	} // if 종료
	else {
		System.err.println(" [안내] 카푸치노 재고가 부족합니다 : 주문취소 ");
	}
	return 카푸치노_구매수;
} // 메소드 종료	
	
	
int 그린티라떼() {
	if( 그린티라떼_재고 > 0 ) {
		그린티라떼_구매수++;
		그린티라떼_재고--;

		
	} // if 종료
	else {
		System.err.println(" [안내] 그린티라떼 재고가 부족합니다 : 주문취소 ");
	}
	return 그린티라떼_구매수;
} // 메소드 종료	
	

// ------------------------------------------------------------------




// --------------------------- 장바구니 메소드 ---------------------------

void 장바구니(){
	
	총금액 = 0;
	
	if( 아메리카노_구매수 > 0 ) {
		System.out.println( " 아메리카노 : " + 아메리카노_구매수 + "개, 금액 : " + 아메리카노_구매수*1000 + "원" );
		총금액 += (아메리카노_구매수*1000);
		
	} // if 종료
		
	if( 바닐라라떼_구매수 > 0) {
		System.out.println( " 바닐라라떼 : " + 바닐라라떼_구매수 + "개, 금액 : " + 바닐라라떼_구매수*1500 + "원" );
		총금액 += (바닐라라떼_구매수*1500);
		
	} // if 종료
		
	if( 카페라떼_구매수 > 0) {
		System.out.println( " 카페라떼 : " + 카페라떼_구매수 + "개, 금액 : " + 카페라떼_구매수*2000 + "원" );
		총금액 += (카페라떼_구매수*2000);
		
	} // if 종료
	
	if( 카푸치노_구매수 > 0) {
		System.out.println( " 카푸치노 : " + 카푸치노_구매수 + "개, 금액 : " + 카푸치노_구매수*2500 + "원" );
		총금액 += (카푸치노_구매수*2500);
		
	} // if 종료
	
	if( 그린티라떼_구매수 > 0) {
		System.out.println( " 그린티라떼 : " + 그린티라떼_구매수 + "개, 금액 : " + 그린티라떼_구매수*3000 + "원" );
		총금액 += (그린티라떼_구매수*3000);
		
	} // if 종료
	System.out.println( " 총금액 : " + 총금액 + "원");
		
	
} // 메소드 종료
	
//------------------------------------------------------------------	
	
	


//--------------------------- 결제 메소드 ---------------------------

public void 결제( int 결제금액 ) {
	총매출금액 += 총금액;
	if( 결제금액 == 총금액 ) {
		if(아메리카노_구매수 > 0 ) {
			아메리카노_매출량 += 아메리카노_구매수;
		}
		if(바닐라라떼_구매수 > 0 ) {
			바닐라라떼_매출량 += 바닐라라떼_구매수;
		}
		if(카페라떼_구매수 > 0 ) {
			카페라떼_매출량 += 카페라떼_구매수;
		}
		if(카푸치노_구매수 > 0 ) {
			카페라떼_매출량 += 카푸치노_구매수;
		}
		if(그린티라떼_구매수 > 0 ) {
			그린티라떼_매출량 += 그린티라떼_구매수;
		}
		System.out.println(" [안내] 결제가 완료되었습니다. ");
		총금액 = 0;
		아메리카노_구매수 = 0;
		바닐라라떼_구매수 = 0;
		카페라떼_구매수 = 0;
		카푸치노_구매수 = 0;
		그린티라떼_구매수 = 0;

		return;
	} // if 종료
	
	else if ( 결제금액 > 총금액 ) {
		System.out.println(" [안내] 잔돈을 반환 받으세요. ");
		System.out.println( " " + (결제금액 - 총금액) + "원");
		
		if(아메리카노_구매수 > 0 ) {
			아메리카노_매출량++;
		}
		if(바닐라라떼_구매수 > 0 ) {
			바닐라라떼_매출량++;
		}
		if(카페라떼_구매수 > 0 ) {
			카페라떼_매출량++;
		}
		if(카푸치노_구매수 > 0 ) {
			카페라떼_매출량++;
		}
		if(그린티라떼_구매수 > 0 ) {
			그린티라떼_매출량++;
		}
		
		System.out.println(" [안내] 결제가 완료되었습니다. ");
		총금액 = 0;
		아메리카노_구매수 = 0;
		바닐라라떼_구매수 = 0;
		카페라떼_구매수 = 0;
		카푸치노_구매수 = 0;
		그린티라떼_구매수 = 0;
		
		return;
	} // if 종료
	
	else if ( 결제금액 < 총금액 ) {
		System.out.println(" [안내] 금액이 부족합니다 : 결제취소 ");
		return;
	}
} // 메소드 종료

//------------------------------------------------------------------	




//--------------------------- 재고추가 메소드 ---------------------------

void 재고추가 ( int menu_select2, int add ) {
	
	if( menu_select2 == 1 ) { // 1번 아메리카노 추가
		아메리카노_재고 += add;
	}
	
	else if ( menu_select2 == 2 ) { // 2번 바닐라라떼 추가
		바닐라라떼_재고 += add;
	}
	
	else if ( menu_select2 == 3 ) { // 3번 카페라떼 추가
		카페라떼_재고 += add;	
	}
		
	else if ( menu_select2 == 4 ) { // 4번 카푸치노 추가
		카푸치노_재고 += add;
	}
		
	else if ( menu_select2 == 5 ) { // 5번 그린티라떼 추가
		그린티라떼_재고 += add;
	}
	

} // 메소드 종료



















	
	
	
}
